<img style="float: left;;" src='../Imagenes/iteso.jpg' width="50" height="100"/></a>

# <center> <font color= #000047> Módulo I: Análisis Exploratorio de Datos (EDA) </font> </center>

### ¿Qué es?

Es cuando revisamos por primera vez los datos que nos llegan, por ejemplo un archivo CSV que nos entregan y deberemos intentar comprender **¿de qué se trata?**, vislumbrar posibles patrones y reconociendo distribuciones estadísticas que puedan ser útiles en el futuro.

Lo ideal es que tengamos un objetivo que nos hayan *“adjuntado”* con los datos, que indique lo que se quiere conseguir a partir de esos datos. Por ejemplo, nos pasan un excel y nos dicen *“Queremos predecir ventas a 30 días”*, ó *“Clasificar casos malignos/benignos de una enfermedad”*, *“Queremos identificar audiencias que van a realizar re-compra de un producto”*, *“queremos hacer pronóstico de fidelización de clientes/abandonos”*, *“Quiero detectar casos de fraude en mi sistema en tiempo real”*.

### ¿Que hacer cuando llegar un archivo?

- ¿Cuántos registros hay?
    - ¿Son demasiado pocos?
    - ¿Son muchos y no tenemos Capacidad (CPU+RAM) suficiente para procesarlo?
    
- ¿Están todas las filas completas ó tenemos campos con valores nulos?
    - En caso que haya demasiados nulos: ¿Queda el resto de información inútil?
    
- ¿Que datos son discretos y cuales continuos?
    - Muchas veces sirve obtener el tipo de datos: texto, int, double, float
    
- Si es un problema de tipo supervisado:
    - ¿Cuál es la columna de “salida”? ¿binaria, multiclase?
    - ¿Esta balanceado el conjunto salida?
    
- ¿Cuales parecen ser features importantes? ¿Cuales podemos descartar?

- ¿Siguen alguna distribución?

- ¿Hay correlación entre features (características)?

- En problemas de NLP es frecuente que existan categorías repetidas ó mal tipeadas, ó con mayusculas/minúsculas, singular y plural, por ejemplo “Abogado” y “Abogadas”, “avogado” pertenecerían todos a un mismo conjunto.

- ¿Estamos ante un problema dependiente del tiempo? Es decir un TimeSeries.

- Si fuera un problema de Visión Artificial: ¿Tenemos suficientes muestras de cada clase y variedad, para poder hacer generalizar un modelo de Machine Learning?

- ¿Cuales son los Outliers? (unos pocos datos aislados que difieren drásticamente del resto y “contaminan” ó desvían las distribuciones)
    - Podemos eliminarlos? es importante conservarlos?
    - son errores de carga o son reales?
    
- ¿Tenemos posible sesgo de datos? (por ejemplo perjudicar a clases minoritarias por no incluirlas y que el modelo de ML discrimine)

## Ejemplo de un EDA

In [1]:
import pandas as pd
import numpy as np

In [3]:
df_movie = pd.read_csv('../Data/movie_metadata.csv')
df_movie.head()

,color,director_name,num_critic_for_reviews,duration,director_facebook_likes,actor_3_facebook_likes,actor_2_name,actor_1_facebook_likes,gross,genres,...,num_user_for_reviews,language,country,content_rating,budget,title_year,actor_2_facebook_likes,imdb_score,aspect_ratio,movie_facebook_likes
0,Color,James Cameron,723.0,178.0,0.0,855.0,Joel David Moore,1000.0,760505847.0,Action|Adventure|Fantasy|Sci-Fi,...,3054.0,English,USA,PG-13,237000000.0,2009.0,936.0,7.9,1.78,33000
1,Color,Gore Verbinski,302.0,169.0,563.0,1000.0,Orlando Bloom,40000.0,309404152.0,Action|Adventure|Fantasy,...,1238.0,English,USA,PG-13,300000000.0,2007.0,5000.0,7.1,2.35,0
2,Color,Sam Mendes,602.0,148.0,0.0,161.0,Rory Kinnear,11000.0,200074175.0,Action|Adventure|Thriller,...,994.0,English,UK,PG-13,245000000.0,2015.0,393.0,6.8,2.35,85000
3,Color,Christopher Nolan,813.0,164.0,22000.0,23000.0,Christian Bale,27000.0,448130642.0,Action|Thriller,...,2701.0,English,USA,PG-13,250000000.0,2012.0,23000.0,8.5,2.35,164000
4,NaN,Doug Walker,NaN,NaN,131.0,NaN,Rob Walker,131.0,NaN,Documentary,...,NaN,NaN,NaN,NaN,NaN,NaN,12.0,7.1,NaN,0

In [4]:
df_movie.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5043 entries, 0 to 5042
Data columns (total 28 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   color                      5024 non-null   object
 1   director_name              4939 non-null   object
 2   num_critic_for_reviews     4993 non-null   float64
 3   duration                   5028 non-null   float64
 4   director_facebook_likes    4939 non-null   float64
 5   actor_3_facebook_likes     5020 non-null   float64
 6   actor_2_name               5030 non-null   object
 7   actor_1_facebook_likes     5036 non-null   float64
 8   gross                      4159 non-null   float64
 9   genres                     5043 non-null   object
 10  actor_1_name               5036 non-null   object
 11  movie_title                5043 non-null   object
 12  num_voted_users            5043 non-null   int64
 13  cast_total_facebook_likes  5043 non-null   int64
 14  actor_3_name               5020 non-null   object
 15  facenumber_in_poster       5030 non-null   float64
 16  plot_keywords              4890 non-null   object
 17  movie_imdb_link            5043 non-null   object
 18  num_user_for_reviews       5022 non-null   float64
 19  language                   5031 non-null   object
 20  country                    5038 non-null   object
 21  content_rating             4740 non-null   object
 22  budget                     4551 non-null   float64
 23  title_year                 4935 non-null   float64
 24  actor_2_facebook_likes     5030 non-null   float64
 25  imdb_score                 5043 non-null   float64
 26  aspect_ratio               4714 non-null   float64
 27  movie_facebook_likes       5043 non-null   int64
dtypes: float64(13), int64(3), object(12)
memory usage: 1.1+ MB

In [5]:
class CDIN:
    def __init__(self, df):
        self.data = df
    # Métodos para clasificación de Datos en un DataFrame (Cualitativos, Cuantitativos, Binarios)
    
    #def get_cuantitativos:
    #    return col_cuantitativos, df_cuantitativos
    
    #def get_cualitativos:
    #    return col_cualitativos, df_cualitativos
    
    def get_binaries(self):
        df_cat = self.data.select_dtypes(include=['object']).copy()
        column_cat = df_cat.columns
        column_binaries = []
        for col in column_cat:
            if df_cat[col].nunique() == 2:
                column_binaries.append(col)
        return column_binaries, self.data[column_binaries]

In [6]:
cd_movie = CDIN(df_movie)

In [7]:
cd_movie.get_binaries()

(['color'],
       color
 0     Color
 1     Color
 2     Color
 3     Color
 4       NaN
 ...     ...
 5038  Color
 5039  Color
 5040  Color
 5041  Color
 5042  Color

 [5043 rows x 1 columns])

## Manejando datos faltantes

In [10]:
df_movie_clean = df_movie.dropna()
df_movie_clean

,color,director_name,num_critic_for_reviews,duration,director_facebook_likes,actor_3_facebook_likes,actor_2_name,actor_1_facebook_likes,gross,genres,...,num_user_for_reviews,language,country,content_rating,budget,title_year,actor_2_facebook_likes,imdb_score,aspect_ratio,movie_facebook_likes
0,Color,James Cameron,723.0,178.0,0.0,855.0,Joel David Moore,1000.0,760505847.0,Action|Adventure|Fantasy|Sci-Fi,...,3054.0,English,USA,PG-13,237000000.0,2009.0,936.0,7.9,1.78,33000
1,Color,Gore Verbinski,302.0,169.0,563.0,1000.0,Orlando Bloom,40000.0,309404152.0,Action|Adventure|Fantasy,...,1238.0,English,USA,PG-13,300000000.0,2007.0,5000.0,7.1,2.35,0
2,Color,Sam Mendes,602.0,148.0,0.0,161.0,Rory Kinnear,11000.0,200074175.0,Action|Adventure|Thriller,...,994.0,English,UK,PG-13,245000000.0,2015.0,393.0,6.8,2.35,85000
3,Color,Christopher Nolan,813.0,164.0,22000.0,23000.0,Christian Bale,27000.0,448130642.0,Action|Thriller,...,2701.0,English,USA,PG-13,250000000.0,2012.0,23000.0,8.5,2.35,164000
5,Color,Andrew Stanton,462.0,132.0,475.0,530.0,Samantha Morton,640.0,73058679.0,Action|Adventure|Sci-Fi,...,738.0,English,USA,PG-13,263700000.0,2012.0,632.0,6.6,2.35,24000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5026,Color,Olivier Assayas,81.0,110.0,107.0,45.0,Béatrice Dalle,576.0,136007.0,Drama|Music|Romance,...,39.0,French,France,R,4500.0,2004.0,133.0,6.9,2.35,171
5027,Color,Jafar Panahi,64.0,90.0,397.0,0.0,Nargess Mamizadeh,5.0,673780.0,Drama,...,26.0,Persian,Iran,Not Rated,10000.0,2000.0,0.0,7.5,1.85,697
5033,Color,Shane Carruth,143.0,77.0,291.0,8.0,David Sullivan,291.0,424760.0,Drama|Sci-Fi|Thriller,...,371.0,English,USA,PG-13,7000.0,2004.0,45.0,7.0,1.85,19000
5035,Color,Robert Rodriguez,56.0,81.0,0.0,6.0,Peter Marquardt,121.0,2040920.0,Action|Crime|Drama|Romance|Thriller,...,130.0,Spanish,USA,R,7000.0,1992.0,20.0,6.9,1.37,0
5042,Color,Jon Gunn,43.0,90.0,16.0,16.0,Brian Herzlinger,86.0,85222.0,Documentary,...,84.0,English,USA,PG,1100.0,2004.0,23.0,6.6,1.85,456

In [12]:
df_movie.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5043 entries, 0 to 5042
Data columns (total 28 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   color                      5024 non-null   object
 1   director_name              4939 non-null   object
 2   num_critic_for_reviews     4993 non-null   float64
 3   duration                   5028 non-null   float64
 4   director_facebook_likes    4939 non-null   float64
 5   actor_3_facebook_likes     5020 non-null   float64
 6   actor_2_name               5030 non-null   object
 7   actor_1_facebook_likes     5036 non-null   float64
 8   gross                      4159 non-null   float64
 9   genres                     5043 non-null   object
 10  actor_1_name               5036 non-null   object
 11  movie_title                5043 non-null   object
 12  num_voted_users            5043 non-null   int64
 13  cast_total_facebook_likes  5043 non-null   int64
 14  actor_3_name               5020 non-null   object
 15  facenumber_in_poster       5030 non-null   float64
 16  plot_keywords              4890 non-null   object
 17  movie_imdb_link            5043 non-null   object
 18  num_user_for_reviews       5022 non-null   float64
 19  language                   5031 non-null   object
 20  country                    5038 non-null   object
 21  content_rating             4740 non-null   object
 22  budget                     4551 non-null   float64
 23  title_year                 4935 non-null   float64
 24  actor_2_facebook_likes     5030 non-null   float64
 25  imdb_score                 5043 non-null   float64
 26  aspect_ratio               4714 non-null   float64
 27  movie_facebook_likes       5043 non-null   int64
dtypes: float64(13), int64(3), object(12)
memory usage: 1.1+ MB

In [11]:
df_movie_clean.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3756 entries, 0 to 5042
Data columns (total 28 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   color                      3756 non-null   object
 1   director_name              3756 non-null   object
 2   num_critic_for_reviews     3756 non-null   float64
 3   duration                   3756 non-null   float64
 4   director_facebook_likes    3756 non-null   float64
 5   actor_3_facebook_likes     3756 non-null   float64
 6   actor_2_name               3756 non-null   object
 7   actor_1_facebook_likes     3756 non-null   float64
 8   gross                      3756 non-null   float64
 9   genres                     3756 non-null   object
 10  actor_1_name               3756 non-null   object
 11  movie_title                3756 non-null   object
 12  num_voted_users            3756 non-null   int64
 13  cast_total_facebook_likes  3756 non-null   int64
 14  actor_3_name               3756 non-null   object
 15  facenumber_in_poster       3756 non-null   float64
 16  plot_keywords              3756 non-null   object
 17  movie_imdb_link            3756 non-null   object
 18  num_user_for_reviews       3756 non-null   float64
 19  language                   3756 non-null   object
 20  country                    3756 non-null   object
 21  content_rating             3756 non-null   object
 22  budget                     3756 non-null   float64
 23  title_year                 3756 non-null   float64
 24  actor_2_facebook_likes     3756 non-null   float64
 25  imdb_score                 3756 non-null   float64
 26  aspect_ratio               3756 non-null   float64
 27  movie_facebook_likes       3756 non-null   int64
dtypes: float64(13), int64(3), object(12)
memory usage: 851.0+ KB

In [13]:
df_movie['duration']

0       178.0
1       169.0
2       148.0
3       164.0
4         NaN
        ...
5038     87.0
5039     43.0
5040     76.0
5041    100.0
5042     90.0
Name: duration, Length: 5043, dtype: float64

In [14]:
df_movie['duration'].mean()

107.2010739856802

In [15]:
df_movie['duration'].fillna(df_movie['duration'].mean())

0       178.000000
1       169.000000
2       148.000000
3       164.000000
4       107.201074
           ...
5038     87.000000
5039     43.000000
5040     76.000000
5041    100.000000
5042     90.000000
Name: duration, Length: 5043, dtype: float64

In [16]:
df_movie['genres']

0       Action|Adventure|Fantasy|Sci-Fi
1              Action|Adventure|Fantasy
2             Action|Adventure|Thriller
3                       Action|Thriller
4                           Documentary
                     ...
5038                       Comedy|Drama
5039       Crime|Drama|Mystery|Thriller
5040              Drama|Horror|Thriller
5041               Comedy|Drama|Romance
5042                        Documentary
Name: genres, Length: 5043, dtype: object

In [19]:
df_movie['color'].unique()

array(['Color', nan, ' Black and White'], dtype=object)

In [20]:
df_movie['color'].fillna('unk')

0       Color
1       Color
2       Color
3       Color
4         unk
        ...
5038    Color
5039    Color
5040    Color
5041    Color
5042    Color
Name: color, Length: 5043, dtype: object

In [22]:
df_movie['director_name']

0           James Cameron
1          Gore Verbinski
2              Sam Mendes
3       Christopher Nolan
4             Doug Walker
              ...
5038          Scott Smith
5039                  NaN
5040     Benjamin Roberds
5041          Daniel Hsia
5042             Jon Gunn
Name: director_name, Length: 5043, dtype: object

In [23]:
dirty_df = pd.read_csv('../Data/dirty_data.csv')

In [24]:
dirty_df

    age  birth_date     marital                            people          ssn
0    24  02/12/1954     soltero                  Alfonso A,guilar         6439
1    35  05/07/1958      casado                 edu6ardo Castillo  689 24 9939
2    46  01-26-1956     Soltero                     jocelyn medel  306-05-2792
3    57  19xx-10-23  divorciado                VICTOR ramos _ _ _  99922a45832
4    10  02/12/0054     SOLTERO    CARLOS EDUARDO; OCHOA ARAMBULA         6439
5    25  05/07/1958      CASado        JOSE MANUEL OCHOA CARDENAS  689 24 9939
6    63  01-26-1956     Soltero         JUAN MARIO; OCHOA NAVARRO  306-05-2792
7    59  19xx?10-23  DIVORCIADO             LUIS ONTANEDA MIJARES  99922a45832
8    69  02/12/1954     soltero       EDUARDO OMAR ORTEGA RAMIREZ          NaN
9    59  05/07/1958         NaN  JOSE ALEJANDRO& PRECIADO GANDARA         6439
10   20  01-26-1956     Soltero  Jose Aantonio Quintero Rodriguez  689 24 9938
11   25  19xx-10-23  divorciado           JOSE ALFONSO RAMIREZ D.  306-06-2792
12   30  02/12/0054     missing           ANA PAULA RANGEL OCHOA&  99922a45845
13   35  05/07/1958      casado                Arturo RUIZ CHAVEZ      missing

# Limpieza de los datos

In [25]:
import string

In [26]:
string.punctuation

'!"#$%&\'()*+,-./:;<=>?@[\\]^_`{|}~'

In [27]:
# remover signos de puntuación
def remove_punctuation(x):
    try:
        x = ''.join(ch for ch in x if ch not in string.punctuation)
    except:
        print(f'{x} no es una cadena de caracteres')
        pass
    return x

In [28]:
s = 'CAR%LOS, EDUARDO; OCHOA AR&AMBULA'

In [29]:
remove_punctuation(s)

'CARLOS EDUARDO OCHOA ARAMBULA'

In [30]:
remove_punctuation(5)

5 no es una cadena de caracteres

5

In [31]:
dirty_df['people'].apply(remove_punctuation)

0                      Alfonso Aguilar
1                    edu6ardo Castillo
2                        jocelyn medel
3                      VICTOR ramos
4        CARLOS EDUARDO OCHOA ARAMBULA
5           JOSE MANUEL OCHOA CARDENAS
6             JUAN MARIO OCHOA NAVARRO
7                LUIS ONTANEDA MIJARES
8          EDUARDO OMAR ORTEGA RAMIREZ
9      JOSE ALEJANDRO PRECIADO GANDARA
10    Jose Aantonio Quintero Rodriguez
11              JOSE ALFONSO RAMIREZ D
12              ANA PAULA RANGEL OCHOA
13                  Arturo RUIZ CHAVEZ
Name: people, dtype: object

In [32]:
string.digits

'0123456789'

In [33]:
def remove_digits(x):
    try:
        x = "".join(ch for ch in x if ch not in string.digits)
    except:
        print(f'{x} no es una cadena de caracteres')
        pass
    return x

In [34]:
s = 'edu6ardo Castillo'

In [35]:
remove_digits(s)

'eduardo Castillo'

In [36]:
dirty_df['people'].apply(remove_punctuation).apply(remove_digits)

0                      Alfonso Aguilar
1                     eduardo Castillo
2                        jocelyn medel
3                      VICTOR ramos
4        CARLOS EDUARDO OCHOA ARAMBULA
5           JOSE MANUEL OCHOA CARDENAS
6             JUAN MARIO OCHOA NAVARRO
7                LUIS ONTANEDA MIJARES
8          EDUARDO OMAR ORTEGA RAMIREZ
9      JOSE ALEJANDRO PRECIADO GANDARA
10    Jose Aantonio Quintero Rodriguez
11              JOSE ALFONSO RAMIREZ D
12              ANA PAULA RANGEL OCHOA
13                  Arturo RUIZ CHAVEZ
Name: people, dtype: object

In [37]:
#remover espacios en blanco
def remove_whitespace(x):
    try:
        x=' '.join(x.split())
    except:
        pass
    return x

In [38]:
#convertimos a minúsculas
def lower_text(x):
    try:
        x=x.lower()
    except:
        pass
    return x

In [39]:
#Convertimos a mayúsculas
def upper_text(x):
    try:
        x=x.upper()
    except:
        pass
    return x

In [40]:
# función convierta a mayúsculas la primera letra
def capitalize_text(x):
    try:
        x = x.capitalize()
    except:
        pass
    return x

In [42]:
dirty_df['people'].apply(remove_punctuation).apply(remove_digits).apply(capitalize_text).apply(remove_whitespace)

0                      Alfonso aguilar
1                     Eduardo castillo
2                        Jocelyn medel
3                         Victor ramos
4        Carlos eduardo ochoa arambula
5           Jose manuel ochoa cardenas
6             Juan mario ochoa navarro
7                Luis ontaneda mijares
8          Eduardo omar ortega ramirez
9      Jose alejandro preciado gandara
10    Jose aantonio quintero rodriguez
11              Jose alfonso ramirez d
12              Ana paula rangel ochoa
13                  Arturo ruiz chavez
Name: people, dtype: object

In [44]:
def replace_text(x,to_replace, replacement):
    try:
        x = x.replace(to_replace,replacement)
    except:
        pass
    return x

In [47]:
dirty_df['birth_date'].apply(replace_text, args=('xx','00')).apply(replace_text, args=('-','/'))

0     02/12/1954
1     05/07/1958
2     01/26/1956
3     1900/10/23
4     02/12/0054
5     05/07/1958
6     01/26/1956
7     1900?10/23
8     02/12/1954
9     05/07/1958
10    01/26/1956
11    1900/10/23
12    02/12/0054
13    05/07/1958
Name: birth_date, dtype: object

In [57]:
class CDIN:
    def __init__(self, df):
        self.data = df
    # Métodos para clasificación de Datos en un DataFrame (Cualitativos, Cuantitativos, Binarios)
    
    #def get_cuantitativos:
    #    return col_cuantitativos, df_cuantitativos
    
    #def get_cualitativos:
    #    return col_cualitativos, df_cualitativos
    
    def get_binaries(self):
        df_cat = self.data.select_dtypes(include=['object']).copy()
        column_cat = df_cat.columns
        column_binaries = []
        for col in column_cat:
            if df_cat[col].nunique() == 2:
                column_binaries.append(col)
        return column_binaries, self.data[column_binaries]
    
    ## Métodos para la limpieza de datos
    
    # remover signos de puntuación
    @staticmethod
    def remove_punctuation(x):
        try:
            x = ''.join(ch for ch in x if ch not in string.punctuation)
        except:
            print(f'{x} no es una cadena de caracteres')
            pass
        return x
    @staticmethod
    def remove_digits(x):
        try:
            x = "".join(ch for ch in x if ch not in string.digits)
        except:
            print(f'{x} no es una cadena de caracteres')
            pass
        return x
    #remover espacios en blanco
    @staticmethod
    def remove_whitespace(x):
        try:
            x=' '.join(x.split())
        except:
            pass
        return x
    #convertimos a minúsculas
    @staticmethod
    def lower_text(x):
        try:
            x=x.lower()
        except:
            pass
        return x
    #Convertimos a mayúsculas
    @staticmethod
    def upper_text(x):
        try:
            x=x.upper()
        except:
            pass
        return x
    # función convierta a mayúsculas la primera letra
    @staticmethod
    def capitalize_text(x):
        try:
            x = x.capitalize()
        except:
            pass
        return x
    @staticmethod
    def replace_text(x,to_replace, replacement):
        try:
            x = x.replace(to_replace,replacement)
        except:
            pass
        return x

In [58]:
cd_dirty = CDIN(dirty_df)

In [59]:
cd_dirty.data

    age  birth_date     marital                            people          ssn
0    24  02/12/1954     soltero                  Alfonso A,guilar         6439
1    35  05/07/1958      casado                 edu6ardo Castillo  689 24 9939
2    46  01-26-1956     Soltero                     jocelyn medel  306-05-2792
3    57  19xx-10-23  divorciado                VICTOR ramos _ _ _  99922a45832
4    10  02/12/0054     SOLTERO    CARLOS EDUARDO; OCHOA ARAMBULA         6439
5    25  05/07/1958      CASado        JOSE MANUEL OCHOA CARDENAS  689 24 9939
6    63  01-26-1956     Soltero         JUAN MARIO; OCHOA NAVARRO  306-05-2792
7    59  19xx?10-23  DIVORCIADO             LUIS ONTANEDA MIJARES  99922a45832
8    69  02/12/1954     soltero       EDUARDO OMAR ORTEGA RAMIREZ          NaN
9    59  05/07/1958         NaN  JOSE ALEJANDRO& PRECIADO GANDARA         6439
10   20  01-26-1956     Soltero  Jose Aantonio Quintero Rodriguez  689 24 9938
11   25  19xx-10-23  divorciado           JOSE ALFONSO RAMIREZ D.  306-06-2792
12   30  02/12/0054     missing           ANA PAULA RANGEL OCHOA&  99922a45845
13   35  05/07/1958      casado                Arturo RUIZ CHAVEZ      missing

In [60]:
cd_dirty.get_binaries()

([],
 Empty DataFrame
 Columns: []
 Index: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13])

In [61]:
cd_dirty.remove_punctuation('___?lja%.jajlsa&')

'ljajajlsa'

In [62]:
cd_dirty.data['people'].apply(cd_dirty.remove_punctuation)

0                      Alfonso Aguilar
1                    edu6ardo Castillo
2                        jocelyn medel
3                      VICTOR ramos
4        CARLOS EDUARDO OCHOA ARAMBULA
5           JOSE MANUEL OCHOA CARDENAS
6             JUAN MARIO OCHOA NAVARRO
7                LUIS ONTANEDA MIJARES
8          EDUARDO OMAR ORTEGA RAMIREZ
9      JOSE ALEJANDRO PRECIADO GANDARA
10    Jose Aantonio Quintero Rodriguez
11              JOSE ALFONSO RAMIREZ D
12              ANA PAULA RANGEL OCHOA
13                  Arturo RUIZ CHAVEZ
Name: people, dtype: object

In [63]:
cd_dirty.data['people'].apply(cd_dirty.remove_punctuation).apply(cd_dirty.remove_digits).apply(cd_dirty.capitalize_text).apply(cd_dirty.remove_whitespace)

0                      Alfonso aguilar
1                     Eduardo castillo
2                        Jocelyn medel
3                         Victor ramos
4        Carlos eduardo ochoa arambula
5           Jose manuel ochoa cardenas
6             Juan mario ochoa navarro
7                Luis ontaneda mijares
8          Eduardo omar ortega ramirez
9      Jose alejandro preciado gandara
10    Jose aantonio quintero rodriguez
11              Jose alfonso ramirez d
12              Ana paula rangel ochoa
13                  Arturo ruiz chavez
Name: people, dtype: object

In [64]:
from CDIN import CDIN as acd

In [65]:
acd.remove_punctuation('.!ajs$daljl,)')

'ajsdaljl'

In [67]:
df_cd = acd(dirty_df)

In [68]:
df_cd.data

    age  birth_date     marital                            people          ssn
0    24  02/12/1954     soltero                  Alfonso A,guilar         6439
1    35  05/07/1958      casado                 edu6ardo Castillo  689 24 9939
2    46  01-26-1956     Soltero                     jocelyn medel  306-05-2792
3    57  19xx-10-23  divorciado                VICTOR ramos _ _ _  99922a45832
4    10  02/12/0054     SOLTERO    CARLOS EDUARDO; OCHOA ARAMBULA         6439
5    25  05/07/1958      CASado        JOSE MANUEL OCHOA CARDENAS  689 24 9939
6    63  01-26-1956     Soltero         JUAN MARIO; OCHOA NAVARRO  306-05-2792
7    59  19xx?10-23  DIVORCIADO             LUIS ONTANEDA MIJARES  99922a45832
8    69  02/12/1954     soltero       EDUARDO OMAR ORTEGA RAMIREZ          NaN
9    59  05/07/1958         NaN  JOSE ALEJANDRO& PRECIADO GANDARA         6439
10   20  01-26-1956     Soltero  Jose Aantonio Quintero Rodriguez  689 24 9938
11   25  19xx-10-23  divorciado           JOSE ALFONSO RAMIREZ D.  306-06-2792
12   30  02/12/0054     missing           ANA PAULA RANGEL OCHOA&  99922a45845
13   35  05/07/1958      casado                Arturo RUIZ CHAVEZ      missing

## Reporte de Calidad de Datos

# EDA utilizando el reporte de calidad de datos

### Actividad: En el dataset de accidentes, buscar:

1.- Número de accidentes por fecha

2.- Número de vehículos accidentados por día

3.- Número de accidentados por fecha